#данные - Сведенья которые записанны на каком либо носителе

#информация - Структурированные набор данных, по каким либо правилам

#знания - обработанная информация которая используется в
# качестве опыта и имеет практическое применение (алгоритм)

# написать программу для разделения людей на категории по возрасту
# user_age = int(input("Укажите свой воздаст - "))
# print(f"Ваш возраст - {user_age}")
#
# if user_age == 18:
#     print("Ваша категория - А")
# elif 19 <= user_age <= 25:
#     print("Ваша категория - В")
# else:
#     print("Ваша категория - С")