#данные - Сведенья которые записанны на каком либо носителе

#информация - Структурированные набор данных, по каким либо правилам

#знания - обработанная информация которая используется в
# качестве опыта и имеет практическое применение (алгоритм)

# написать программу для разделения людей на категории по возрасту
# user_age = int(input("Укажите свой воздаст - "))
# print(f"Ваш возраст - {user_age}")
#
# if user_age == 18:
#     print("Ваша категория - А")
# elif 19 <= user_age <= 25:
#     print("Ваша категория - В")
# else:
#     print("Ваша категория - С")

language = "russian"
daytime = "morning"
if language == "english":
    if daytime == "morning":
        print("Good morning")
    else:
        print("Good evening")
else:
    if daytime == "morning":
        print("Доброе утро")
    else:
        print("Добрый вечер")

#напишите программу с несколькими уровнями вложенности операторов if else
# для определения типов шасси и набора
# датчиков необходимых роботу для передвижения по разным поверхностям