# При регистрации в компьютерной системе каждому пользователю выдаётся пароль,
# состоящий из 10 символов. В качестве символов используют прописные буквы латинского алфавита,
# т.е. 26 различных символов. В базе данных для хранения каждого пароля отведено одинаковое и минимально
# возможное целое число байт.
# При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и
# минимально возможным количеством бит. Определите объём памяти (в байтах), необходимый для хранения
# данных о 50 пользователях. В ответе запишите только целое число – количество байт.

# user_age = int(input("Enter your age: "))
# if user_age >= 18 and user_age <= 25:
#     print("A")
# elif user_age < 18:
#     print("C")
# else:
#     print("B")
