# список
# lst = [1, "pencil", True, 3.14]
# lst.append(5)
# print(lst)
# lst.pop(2)
# print(lst)

# lst_m = [[1,1,1],[2,5,2],[3,3,3]]
# print(lst_m[1][1])

rows, colms = 5, 5

matrix = [["*" if r == 2 or c == 2 else "0" for c in range(colms)]for r in range(rows)]

for row in matrix:
    for item in row:
        print(item, end = " ")
    print()

# 0 0 * 0 0
# 0 0 * 0 0
# 0 0 * 0 0
# 0 0 * 0 0
# 0 0 * 0 0

# 0 0 * 0 0
# 0 0 * 0 0
# * * * * *
# 0 0 * 0 0
# 0 0 * 0 0


# * 0 * 0 *
# 0 * * * 0
# * * * * *
# 0 * * * 0
# * 0 * 0 *

#Задача на острова УЛЬТРА МЕГА СЛОЖНЫЙ УРОВЕНЬ !!!
# нужно генерировать карту островов на карте
# острова состоят из суши - * и полностю окружены водой - 0
# карта должна генерироваться рандомно
# правила генерации -
# 1 запрещается внутри острова генерить воду
# 2 остров должен быть полностью окружен водой
# 3 запрещается делать еденичный остров,  минимум 5 - *
# 4 край карты должен быть заполнен водой в 3 ряда