# пример программы которая разрешает доступ в зависимости от возраста

# user_age = int(input("Укажите ваш возраст: "))
# print(f"Ваш возраст - {user_age}")
# if user_age >= 18:
#     print("Доступ разрешен! Добро пожаловать!")
# else:
#     print("Доступ запрещен!")

# читаем ! - https://metanit.com/python/tutorial/2.2.php

#данные - это какие либо сведенья которые записаны на каком либо носителе
#информация - это структурированные данные
#знания - информация которая чем или кем либо подтверждена
# (имеет алгоритм действия для достижения нужного результата)
# функция округления
# calc = 1/3
# print(round(calc, 3))
'''
это многострочный комментарий
'''

# меню программы для пользователя
# user_choice = int(input("___ Выберете нужное действие___ \n"
#                         "1 - деление \n"
#                         "2 - умножение \n"
#                         "3 - сумма"))
#
# num_1 = int(input("Введите 1 число"))
# num_2 = int(input("Введите 2 число"))
#
# if user_choice == 1:
#     print(num_1 / num_2)
# #дописать
# elif user_choice == 2:
#     print(num_1*num_2)

# синтаксический сахар

number = 10
number += "f"
print(number)  # 15

number -= 3
print(number)  # 12

number *= 4
print(number)  # 48