# Проектная ориентация
# 1 экономика проекта (комфорт, долгая и здоровая жизнь, расширение сферы влияния)
# монетизация B to B, B to C, B to G
# 2 типы проектов
# А - проекты для центра талантов
# Б - СУЭК, СГК, ЕвроХим
# В - Общественно полезные проекты
# 3 представление проекта (5W)
# Ответы на вопросы
# 1 Что? Что вы собираетесь делать?
# 2 Зачем этот продукт или изделие будут покупать ? Какую пользу оно может дать ?
# 3 Где вы собираетесь реализовывать и продавать ваше изделие?
# 4 Будет ли сезонность выпуска продуктов? Когда вы сможете продавать ваш продукт? Ситуация которая приведёт к покупке ?
# 5 Кто? Кто будет покупать? Целевая аудитория ?
# ДЗ составить краткий доклад на тему своего проекта