#замыкания
def outer():
    num = 5

    def inner ():
        nonlocal num
        num +=1
        print(num)

    return inner

fu = outer()

fu()
fu()
fu()
fu()
fu()
fu()
fu()
fu()

#задача написать робота пицемейкера
# робот должен принимать заказ от пользователя (учитывать что пользователь может придти не один)
# робот должен предоставить разное меню для разновозрастных пользователей, после идентификации
# пользователя и определения тех позиций которые пользователь хочет купить робот должен спросить,
# как будет проходить оплата (наличнкой или кртой) в случии налички
# пользователь вводит число боле суммы, а робот выдает сдачу