# написать программу для расчета объема памяти необходимого для хранения паролей пользователей
# пользователь вводит мощность алфавита
# вводит длину паролей
# вводит количество пользователей
# if elif else
user_age = int(input("Enter your age"))
if user_age >= 18 and user_age < 25:
    print("A")
elif user_age > 25:
    print("B")
else:
    print("C")

# 1
# Постройте дерево решений для выбора одежды для прогулки
# (в зависимости от погоды и времени года: пуховик, куртка, плащ, ветровка и т.д.).
# 2
# Постройте дерево решений для проверки существует ли указанная
# пользователем дата (учитывать високосный год, количество дней в месяце).

