Умный удлинитель, удлинитель с микроконтроллером который запускает отдельный сайт с статистикой: потраченное напряжение с переводом в деньги, трата энергии в час, распределение нагрузки и предупреждения если что то потребляет слишком много энергии, так же сделать настройку конкретной розетки в удлинителе, например подаваемое напряжение или же с ограничением потребления, это полезно потому что это очень удобно, микроконтроллер не будет потреблять много энергии, безопасность. удлинитель стоит 600 рублей ~, микроконтроллер ~400 руб, ~доп детали и работа 300

итого 1300 руб

1) Это комфорт и удобство, экономит время

2) В

3) 
- Я собираюсь сделать Умный удлинитель со статистикой о потреблении энергии и распределнием энергии, также настройкой отдельных разеток в удлинителе

- Его будут покупать для удобства, оно поможет сэкономить деньги, обеспечить безопасность людям

- Сначала дома, позже выведу на большое производство в заводах

- Да будет, когда куплю все нужные детали, кого то ударило током, розетка загорелась, большая трата электро энергии

- Все, всем возрастам подойдет такая розетка (удлинитель)
