# 1. Дано число n. Создайте массив размером n×n и заполните его по следующему правилу:
# Числа на диагонали, идущей из правого верхнего в левый нижний угол равны 1.
# Числа, стоящие выше этой диагонали, равны 0.
# Числа, стоящие ниже этой диагонали, равны 2.
# Полученный массив выведите на экран. Числа в строке разделяйте одним пробелом.


# 2. Дано число n. Создайте массив размером n×n и заполните его по следующему правилу.
# На главной диагонали должны быть записаны числа 0. На двух диагоналях, прилегающих к главной,
# числа 1. На следующих двух диагоналях числа 2, и т.д.
#
# 3. Даны два числа n и m. Создайте двумерный массив размером n×m и заполните его символами
# "." и "*" в шахматном порядке. В левом верхнем углу должна стоять точка.
