#b - c
#Максимально лёгкая программа для оьучения ревёрс инженеринга.
#встроеные средства обхода простейшых защит
#Втроеный за доп плату помощник(неиросеть) для ревёр инжинеринга(например deeepsik и его api)
#1)я собираюсь делать пргарамму для обучения ревёрс инжинерингу
#2)Для макимально быстрого входа в довольно прибыльную сферу.
#3)реализация - python. Подниму свой сайт на моём втором комьютере, он спокой справится с 1 -1 0 пользователями, а дальше любые самы дешовые хостинги, или уже оснавной компьютер(у меня самы последний ноутбучный райзен, так что справльсю)
#4)ситуация - любой интерес к этой сфере, без сезоности, всегда
#5)целевая аудитория - подростки и молодые люди 12 - 30 лет
