# Данные - сведенья которые записаны на каком либо носителе.
# Информация - структурированные данные.
# Знания - (алгоритм действий или набор инструкций).


# Программа определения возраста.
# user_age = int(input("Укажите, пожалуйста, свой возраст - "))
# print(f"Ваш возраст - {user_age} лет(год(а))")
# if user_age == 18:
#     print("Ваша категория - А")
# elif user_age > 18 and user_age < 50:
#     print("Ваша категория - В")
# else:
#     print("Ваша категория - С")

# Глупый калькулятор (все калькуляторы умны по-своему) -
# num1 = int(input("Введите, пожалуйста, первое число - "))
# num2 = int(input("Введите, пожалуйста, второе число - "))
#
# user_choice = int(input("____Выберите, пожалуйста, действие (никого не принуждаю)____\n"
#                         "1 - сложение \n"
#                         "2 - вычитание\n"
#                         "3 - ... "))
# if user_choice == 1:
#     print(num1+num2)
# elif user_choice == 2:
#     print(num1-num2)
# Дописать если есть желание !

# language = "English"
# daytime = "Morning"
# if language == "English":
#     print("English")
#     if daytime == "Morning":
#         print("Good morning")
#     else:
#         print("Good evening")
# elif language == "Deutch ":
#     print("Deutch")
#     if daytime == "Morning":
#         print("Guten Morgen!")
#     else:
#         print("Guten Abend!")

# Напишите, пожалуйста, программу с несколькими уровнями вложенности операторов if else
# для определения типов шасси и набора
# датчиков необходимых роботу для передвижения по разным поверхностям.

# Спасибо за урок, уважаемые ИЭшники. Всего доброго!
